# Цикл
# Создать список из десяти целых чисел.
# Вывести на экран каждое число, увеличенное на 1.

my_list = range(1, 11)
for i in my_list:
    print(i + 1)