# Цикл
# Ввести с клавиатуры строку.
# Вывести эту же строку вертикально: по одному символу на строку консоли.

my_string = input("Enter a string: ")
for i in my_string:
    print(i)